# Brewfile — hermetic CLI tool dependencies via Homebrew.
#
# Install:  brew bundle install --file=pkgs/Brewfile
# Check:    brew bundle check   --file=pkgs/Brewfile
# Update:   brew upgrade && brew bundle install --file=pkgs/Brewfile

# ---------------------------------------------------------------------------
# Version control
# ---------------------------------------------------------------------------
brew "git"
brew "gh"
brew "lazygit"
brew "tig"
brew "git-delta"       # better diffs

# ---------------------------------------------------------------------------
# Shell & multiplexer
# ---------------------------------------------------------------------------
brew "tmux"
brew "stow"            # dotfile symlink manager

# ---------------------------------------------------------------------------
# Language managers (runtimes installed by pkgs/lang/* scripts)
# ---------------------------------------------------------------------------
brew "rustup"          # Rust toolchain manager; pkgs/lang/rust handles `rustup default stable`
brew "nvm"             # Node version manager; pkgs/lang/node handles `nvm install stable`

# ---------------------------------------------------------------------------
# Core CLI utilities
# ---------------------------------------------------------------------------
brew "ripgrep"
brew "fzf"
brew "fd"
brew "jq"
brew "curl"
brew "wget"
brew "tree"
brew "unzip"
brew "make"
brew "gcc"
brew "vim"
brew "neovim"

# ---------------------------------------------------------------------------
# Modern CLI replacements
# ---------------------------------------------------------------------------
brew "bat"             # cat
brew "eza"             # ls
brew "btop"            # top / htop

# ---------------------------------------------------------------------------
# Navigation & file management
# ---------------------------------------------------------------------------
brew "zoxide"          # smart cd
brew "yazi"            # terminal file manager

# ---------------------------------------------------------------------------
# Dev utilities
# ---------------------------------------------------------------------------
brew "fx"              # JSON explorer
brew "glow"            # Markdown viewer
brew "zellij"          # terminal workspace

# ---------------------------------------------------------------------------
# Prompt
# ---------------------------------------------------------------------------
brew "starship"
brew "atuin"           # shell history
brew "neofetch"        # system info on login

# ---------------------------------------------------------------------------
# Cloud
# ---------------------------------------------------------------------------
# macOS: cask is the official recommended install.
# Linux: Linuxbrew has no cask support; use Google's tap formula instead.
if OS.mac?
  cask "google-cloud-sdk"
else
  tap "google/cloud-sdk"
  brew "google-cloud-sdk"
end

tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
